Configure and Verify Basic Switch Settings
a. Console into the switch. Enter the global configuration mode.
	Switch>enable
	Switch#
b. Go global configure mode - command: configure terminal
c. Give the switch a name according to the Addressing Table.
	Switch#configure terminal
	Switch(config)#hostname RegNo-S1
	S1(config)#
d. Prevent unwanted DNS lookups.
	Switch(config)#no ip domain-lookup
e. Configure password for console access
f. enter line console configuration mode command: line console 0 
(The zero is used to represent the first (and in most cases the 
only) console interface)
g. Set password for CLI command: 
	S1#configure terminal
	S1(config)#line console 0
	S1(config-line)#password 1234
	S1(config-line)#login
	S1(config-line)#end
h. Use class as the privileged EXEC password 
	S1(config)#enable secret class
i. Encrypt the password
	S1#configure terminal
	S1(config)#service password-encryption
	S1(config)#
j. Configure and enable the Switch Virtual Interface according to the 
Addressing Table.
	S1(config)# interface vlan 1
	S1(config-if)# ip address 192.168.1.1 255.255.255.0
	S1(config-if)# no shutdown
	%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan1, 
	changed state to up
k. Configure Banner Messages
	S1#configure terminal
	S1(config)#banner motd #Authorized Access Only#
l. Verify all configuration
	S1#show running-config
m. Save configuration
	S1>enable
	S1#copy running-config startup-config
	Destination filname [startup-config]?
	Building configuration...
	[OK]
	S1
2. Analyze MAC address table
a. Open simulation mode in packet tracer
b. Ty to ping from PC to another PC
c. Check ARP table in switches
	show arp
d. Check MAC address table in switches
	show mac-address-table
e. Check ARP table in PCs
	arp -a
a. Configure hostname according to display name
	hostname <Display_Name>
b. Prevent unwanted DNS lookup
	no ip domain-lookup
c. Configure password protection to console line
	line console 0
	password <Your_Console_Password>
	login
d. Configure VTY line password.
	line vty 0 4
	password <Your_VTY_Password>
	login
e. Configure password protection to privileged EXEC mode
	enable secret <Your_Enable_Password>
f. Encrypt all password
	service password-encryption
g. Assign IP addresses to the interfaces according to the addressing table
	interface <Interface_Name>
	ip address <IP_Address> <Subnet_Mask>
	no shutdown
h. Configure proper banner message
	banner motd #<Your_Banner_Message>#
i. Save configurations
	copy running-config startup-config
i. VLAN 10: Staff
	S1#(config)# vlan 10
	S1#(config-vlan)# name Staff
a) Configure the interfaces as access ports and assign the VLANs as follows.
i. LAN 10: FastEthernet 0/1
	S2(config)# interface f0/1
	S2(config-if)# switchport mode access
	S2(config-if)# switchport access vlan 10
a) Configure FastEthernet 0/11 for Cisco IP Phone and PC-D
	S3(config)# interface f0/1
	S3(config-if)# mls qos trust cos
	S3(config-if)# switchport voice vlan 150
8. Verify loss of connectivity
	S2# show vlan brief
a) Configure G0/1 and G0/2 interfaces on S1 for trunking.
	S1(config)# interface range g0/1 - 2
	S1(config-if)# switchport mode trunk
b) Configure VLAN 99 as the native VLAN for G0/1 and G0/2 interfaces on 
S1.
	S1(config-if)# switchport trunk native vlan 99
Create a user of your choosing with a strong encrypted password.
	S2(config)# username root secret cisco
3. Generate 1024-bit RSA keys.
	S2(config)# crypto key generate rsa
How many bits in the modulus [512]: 1024
4. Configure all VTY lines for SSH access and use the local user profiles for
authentication.
	S2(config)# line vty 0 4
	S2(config-line)# transport input ssh
	S2(config-line)# login local
5. Set the EXEC mode timeout to 6 minutes on the VTY lines.
	S2(config-line)# exec-timeout 6
7. Access the command prompt on the desktop of Management PC to establish an 
SSH connection to S2. Open a command prompt
	C:\> ssh /?
	Packet Tracer PC SSH
	Usage: SSH -l username target
	C:\>
a. On S1, configure the trunk link to dynamic desirable on the interface 
GigabitEthernet 0/1
	S1(config)# interface g0/1
	S1(config)# switchport mode dynamic desirable 
c. For the trunk link between S1 and S3, configure interface 
GigabitEthernet 0/2 as a static trunk link on S1. In addition, disable 
DTP negotiation on interface GigabitEthernet 0/2 on S1 
	S1(config)# interface g0/2
	S1(config)# switchport mode trunk
	S1(config)# switchport nonegotiate
d. Verify DTP status
	S1# show dtp
e. Verify trunking is enabled on all the switches 
	S1# show interface trunk
f. Configure VLAN 999 as the native VLAN for the trunk links on all 
switches.
	S1(config)# interface g0/1
	S1(config)# switchport trunk native vlan 999
Set the encapsulation type 802.1Q, assign VLAN 10 and assign 
the correct IP address to the sub interface.
	R1(config)# int g0/0/0.10
	R1(config-subif)# encapsulation dot1Q 10
	R1(config-subif)# ip address 192.168.1.1 255.255.255.0
Configure Switch Virtual Interface (SVI) on Colors
	Colors(config)# interface vlan 10
	Colors(config-if)# ip address 192.168.1.1 255.255.255.0
Make the interface a static trunk mode
	Colors(config-if-range)# switchport mode trunk
Encaplsulate the link with the dot1q protocol
	Colors(config-if-range)# switchport trunk encapsulation dot1q
. Enable routing in global configuration mode.
	Colors(config)#ip routing
Configure R2 to exclude the first 10 addresses from the R1 LAN.
	R2(config)# ip dhcp excluded-address 192.168.1.1 192.168.1.10
Create a DHCP pool in R2 for R1 LAN named R1-LAN (Case Sensitive)
	R2(config)# ip dhcp pool R1-LAN
Configure the DHCP pool to include the network address, the default gateway,
and the IP address of the DNS server.
	R2(dhcp-config)# network 192.168.1.0 255.255.255.0
	R2(dhcp-config)# default-router 192.168.1.1
	R2(dhcp-config)# dns-server 192.168.2.10
7. Configure R1 and R3 as a DHCP relay agent
	R1(config)# interface g0/0
	R1(config-if)# ip helper-address 192.168.4.1
Enable IPv6 routing in both routers
	R1(config)# ipv6 unicast-routing
Create a stateless DHCP (SLAAC) pool in R1 for R1 LAN named
	R1-STATELESS (Case Sensitive)
	R1(config)# ipv6 dhcp pool R1-STATELESS
	R1(config-dhcp)# dns-server 2001:db8:acad::254
	R1(config-dhcp)# domain-name stateless.com
Configure the G0/0/1 interface on R1 to provide the other config flag to the
	R1 LAN and assign the DHCP pool.
	R1(config)# interface g0/0/1
	R1(config-if)# ipv6 nd other-config-flag
	R1(config-if)# ipv6 dhcp server R1-STATELESS
Create a stateful DHCPv6 pool in R1 for R2 LAN named R2-STATEFUL
(Case Sensitive)
	R1(config)# ipv6 dhcp pool R2-STATEFUL
	R1(config-dhcp)# address prefix 2001:db8:acad:3::/64
	R1(config-dhcp)# dns-server 2001:db8:acad::254
	R1(config-dhcp)# domain-name stateful.com
Assign the DHCPv6 pool you just created to interface g0/0/0 on R1.
	R1(config)# interface g0/0/0
	R1(config-if)# ipv6 dhcp server R2-STATEFUL
9. Configure R2 as an IPv6 dhcp relay agent
	R2(config)# interface g0/0/1
	R2(config-if)# ipv6 nd managed-config-flag
	R2(config-if)# ipv6 dhcp relay destination 2001:db8:acad:2::1 g0/0/0
Configure an EtherChannel with Cisco PAgP on S1 and S3
	S1(config)# interface range f0/11â€“ 12
	S1(config-if-range)# shutdown
	S1(config-if-range)# channel-group 1 mode desirable
	S1(config-if-range)# no shutdown
	S3(config)# interface range f0/11-12
	S3(config-if-range)# shutdown
	S3(config-if-range)# channel-group 1 mode desirable
	S3(config-if-range)# no shutdown
2. Configure the logical interface to become a trunk by first entering the interface 
port-channel number command and then the switchport mode trunk command
	S1(config)# interface port-channel 1
	S1(config-if)# switchport mode trunk
	S3(config)# interface port-channel 1
	S3(config-if)# switchport mode trunk
3. Configure an 802.3ad LACP EtherChannel on S2 and S4
	S2(config)# interface range f0/11 - 12
	S2(config-if-range)# shutdown
	S2 (config-if-range)# channel-group 2 mode active
	S2(config-if-range)# no shutdown
	S2(config-if-range)# interface port-channel 2
	S2(config-if)# switchport mode trunk
4. Configure a Redundant EtherChannel Link on S3
	S3(config)# interface range f0/21 - 22
	S3(config-if-range)# shutdown
	S3(config-if-range)# channel-group 3 mode passive
	S3(config-if-range)# no shutdown
	S3(config-if-range)# interface port-channel 3
	S3(config-if)# switchport mode trunk
Configure HSRP on R3
	R3(config)# interface g0/0/0
4. Specify the HSRP protocol version number. The most recent version is version 
Note: Standby version 1 only supports IPv4 addressing
	R3(config-if)# standby version 2
5. Configure the IP address of the virtual default gateway
	R3(config-if)# standby 1 ip 192.168.6.254
6. Designate the active router for the HSRP group
	R3(config-if)# standby 1 priority 150
7. R3 will operate as the active router and traffic from the two LANs will use it 
as the default gateway
	R1(config-if)# standby 1 preempt
Disable DTP negotiation on S1 G0/1 interface. 
	S1(config-if)#switchport nonegotiate
2. Create VLAN 100 and give it the name Native on S1 and Configure G0/1 
trunk port use VLAN 100 as the native VLAN.
	S1(config)#vlan 100
	S1(config-vlan)#name Native
	S1(config)#interface GigabitEthernet0/1
	S1(config-if)#switchport trunk native vlan 100
3. Secure Unused Switchport
a. Shutdown all unused switch ports on S3. 
	S3(config)#interface range F0/3-10, F0/13-20, F0/23-24, G0/1-2
	S3(config-if-range)#shutdown
	S3(config-if-range)#exit
On S3, create a VLAN 999 and name it BlackHole. The configured 
name must match the requirement exactly.
	S3(config)#vlan 999
	S3(config-vlan)#name BlackHole
	S3(config-vlan)#exit
c. Move all unused switch ports to the BlackHole VLAN. 
	S3(config)#interface range F0/3-10, F0/13-20, F0/23-24, G0/1-2
	S3(config-if-range)#switchport access vlan 99
Activate port security on all the active access ports on switch S3
	S3(config)#interface range FastEthernet0/1-2
	S3(config-if-range)#switchport mode access
	S3(config-if-range)#switchport port-security
b. Configure the active ports to allow a maximum of 4 MAC addresses to 
be learned on the ports.
	S3(config)#interface range FastEthernet0/1-2
	S3(config-if-range)#switchport port-security maximum 4
c. For ports F0/1 on S3, statically configure the MAC address of the PC 
using port security. 
	S3(config)#interface FastEthernet0/1
	S3(config-if)#switchport port-security mac-address <<PC-Add>>
d. Configure each active access port so that it will automatically add the 
MAC addresses learned on the port to the running configuration.
	S3(config)#interface range FastEthernet0/1-2
	S3(config-if-range)#switchport port-security mac-address sticky
Configure the port security violation mode to drop packets from MAC 
addresses that exceed the maximum, generate a Syslog entry, but not 
disable the ports. 
	S3(config)#interface range FastEthernet0/1-2
	S3(config-if-range)#switchport port-security violation restrict
Configure the trunk ports on S3 as trusted ports. 
	S3(config)#interface range FastEthernet0/11-12
	S3(config-if-range)#ip dhcp snooping trust
b. Limit the untrusted ports on S3 to five DHCP packets per second. 
	S3(config)#interface range FastEthernet0/1-2
	S3(config-if-range)#ip dhcp snooping limit rate 5
c. On S4, enable DHCP snooping globally and for VLANs 30 and 40.
	S4(config)#ip dhcp snooping
	S4(config)#ip dhcp snooping vlan 30,40
Enable PortFast on all the access ports that are in use on S3.
	S3(config)#interface range FastEthernet0/1-2
	(config-if-range)#spanning-tree portfast
b. Enable BPDU Guard on all the access ports that are in use on S3. 
	S3(config)#interface range FastEthernet0/1-2
	S3(config-if-range)#spanning-tree bpduguard enable
c. Configure S4 so that all access ports will use PortFast by default.
	S4(config)#spanning-tree portfast default
On R1, configure next hop IPv4 default static route. This primary
default router should be through router R2.
	R1(config)#ip route 0.0.0.0 0.0.0.0 10.1.1.2
b. On R1, configure directly connected IPv4 floating static default route.
This default route should be through router R3. It should have an
administrative distance of 5.
	R1(config)#ip route 0.0.0.0 0.0.0.0 G0/0/0 5
On R1, configure a next hop IPv4 static route to the LAN 1 network
through R2.
	R1(config)#ip route 192.168.1.0 255.255.255.0 10.1.1.2
b. On R1, configure a next hop IPv4 static route to the LAN 2 network
through R3
	R1(config)#ip route 192.168.2.0 255.255.255.0 10.1.1.2
c. On R1, configure a directly connected IPv4 floating static route to the
LAN 1 network through R3, use administrative distance 5.
	R1(config)#ip route 192.168.1.0 255.255.255.0 G0/0/0 5
d. On R1, configure a directly connected IPv4 floating static route to the
LAN 2 network through R3, use administrative distance 5.
	R1(config)#ip route 192.168.2.0 255.255.255.0 G0/0/0 5
On R2, configure an IPv4 next hop host route to the Server through
R1.
	R2(config)#ip route 192.168.3.10 255.255.255.255 10.1.1.1
b. On R2, configure an IPv4 directly connected floating host route to the
Server through R3, use administrative distance 5.
	R2(config)#ip route 192.168.3.10 255.255.255.255 S0/1/1 5
On R1, configure next hop IPv6 default static route. This primary
default router should be through router R2.
	R1(config)#ipv6 route ::/0 2001:DB8:ACAD:4::2
b. On R1, configure directly connected IPv6 floating static default route.
This default route should be through router R3. It should have an
administrative distance of 5.
	R1(config)#ipv6 route ::/0 G0/0/0 5
On R1, configure a next hop IPv6 static route to the LAN 1 network
through R2.
	R1(config)#ipv6 route 2001:DB8:ACAD:1::/64 2001:DB8:ACAD:4::2
b. On R1, configure a next hop IPv6 static route to the LAN 2 network
through R3
	R1(config)#ipv6 route 2001:DB8:ACAD:2::/64 2001:DB8:ACAD:4::2
c. On R1, configure a directly connected IPv6 floating static route to the
LAN 1 network through R3, use administrative distance 5.
	R1(config)#ipv6 route 2001:DB8:ACAD:1::/64 G0/0/0 5
d. On R1, configure a directly connected IPv6 floating static route to the
LAN 2 network through R3, use administrative distance 5.
	R1(config)#ipv6 route 2001:DB8:ACAD:2::/64 G0/0/0 5
On R2, configure an IPv6 next hop host route to the Server through
R1.
	R2(config)#ipv6 route 2001:DB8:ACAD:3::10/128 2001:DB8:ACAD:4::1
b. On R2, configure an IPv6 directly connected floating host route to the
Server through R3, use administrative distance 5.
	R2(config)#ipv6 route 2001:DB8:ACAD:3::10/128 S0/1/1 5